devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
/*=========================================================================*//**
@file    uart_lld.c

@author  Daniel Zorychta

@brief   This file support USART peripherals for STM32F1/F3/F4/F7/H7.
         * STM32F7 architecture is supported without extra features.
         * STM32H7 architecture is supported without extra features.

@note    Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"

#include "uart.h"
#include "uart_ioctl.h"
#include "stm32fx/uart_cfg.h"

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#include "stm32f1/lib/stm32f10x_rcc.h"
#define RDR                     DR
#define TDR                     DR
#define USART_CLKSOURCE_PCLK1   1
#define USART_CLKSOURCE_PCLK2   2
#elif defined(ARCH_stm32f3)
#include "stm32f3/stm32f3xx.h"
#include "stm32f3/lib/stm32f3xx_ll_rcc.h"
#define SR                      ISR
#define USART_SR_RXNE           USART_ISR_RXNE
#define USART_SR_ORE            USART_ISR_ORE
#define USART_SR_TC             USART_ISR_TC
#elif defined(ARCH_stm32f4)
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/lib/stm32f4xx_rcc.h"
#define RDR                     DR
#define TDR                     DR
#define USART_CLKSOURCE_PCLK1   1
#define USART_CLKSOURCE_PCLK2   2
#elif defined(ARCH_stm32f7)
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/lib/stm32f7xx_ll_rcc.h"
#define SR                      ISR
#define USART_SR_RXNE           USART_ISR_RXNE
#define USART_SR_ORE            USART_ISR_ORE
#define USART_SR_TC             USART_ISR_TC
#elif defined(ARCH_stm32h7)
#include "stm32h7/stm32h7xx.h"
#include "stm32h7/lib/stm32h7xx_ll_rcc.h"
#define SR                      ISR
#define USART_SR_RXNE           USART_ISR_RXNE_RXFNE
#define USART_SR_ORE            USART_ISR_ORE
#define USART_SR_TC             USART_ISR_TC
#endif

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/* UART registers */
typedef struct {
        USART_TypeDef  *UART;
        __IO uint32_t  *APBENR;
        __IO uint32_t  *APBRSTR;
        const uint32_t  APBENR_UARTEN;
        const uint32_t  APBRSTR_UARTRST;
        const IRQn_Type IRQn;
        const u32_t     CLKSRC;
} UART_regs_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/

/*==============================================================================
  Local object definitions
==============================================================================*/
// all registers which are need to control particular UART peripheral
static const UART_regs_t UART[] = {
        #if defined(RCC_APB2ENR_USART1EN)
        {
                .UART            = USART1,
                .IRQn            = USART1_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART1EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART1RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART1EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART1RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK2,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_USART1_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_USART1_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART16_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_USART2EN) || defined(RCC_APB1LENR_USART2EN)
        {
                .UART            = USART2,
                .IRQn            = USART2_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_USART2EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_USART2RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_USART2EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_USART2RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_USART2_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_USART2_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART234578_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_USART3EN) || defined(RCC_APB1LENR_USART3EN)
        {
                .UART            = USART3,
                .IRQn            = USART3_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_USART3EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_USART3RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_USART3EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_USART3RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_USART3_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_USART3_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART234578_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART4EN) || defined(RCC_APB1LENR_UART4EN)
        {
                .UART            = UART4,
                .IRQn            = UART4_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART4EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART4RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART4EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART4RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART4_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_UART4_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART234578_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART5EN) || defined(RCC_APB1LENR_UART5EN)
        {
                .UART            = UART5,
                .IRQn            = UART5_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART5EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART5RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART5EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART5RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART5_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_UART5_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART234578_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_USART6EN)
        {
                .UART            = USART6,
                .IRQn            = USART6_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART6EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART6RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART6EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART6RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK2,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_USART6_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_USART6_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART16_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART7EN) || defined(RCC_APB1LENR_UART7EN)
        {
                .UART            = UART7,
                .IRQn            = UART7_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART7EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART7RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART7EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART7RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART7_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_UART7_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART234578_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART8EN) || defined(RCC_APB1LENR_UART8EN)
        {
                .UART            = UART8,
                .IRQn            = UART8_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART8EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART8RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART8EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART8RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART8_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_UART8_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART234578_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_UART9EN)
        {
                .UART            = UART9,
                .IRQn            = UART9_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART9EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART9RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART9EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART9RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART9_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART9_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_UART9_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART16910_CLKSOURCE,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_UART10EN) || defined(RCC_APB2ENR_USART10EN)
        {
                .UART            = UART10,
                .IRQn            = UART10_IRQn,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART10EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART10RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART10EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART10RST,
                #endif
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART10_CLKSOURCE,
                #elif defined(ARCH_stm32f7)
                .CLKSRC          = LL_RCC_UART10_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC          = LL_RCC_USART16910_CLKSOURCE,
                #endif
        }
        #endif
};

/*==============================================================================
  Function definitions
==============================================================================*/
//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param[in] UART              UART registers
 *
 * @return One of errno value
 */
//==============================================================================
int _UART_LLD__turn_on(u8_t major)
{
        if (!(*UART[major].APBENR & UART[major].APBENR_UARTEN)) {
                SET_BIT(*UART[major].APBRSTR, UART[major].APBRSTR_UARTRST);
                CLEAR_BIT(*UART[major].APBRSTR, UART[major].APBRSTR_UARTRST);
                SET_BIT(*UART[major].APBENR, UART[major].APBENR_UARTEN);

                NVIC_EnableIRQ(UART[major].IRQn);
                NVIC_SetPriority(UART[major].IRQn, _UART_IRQ_PRIORITY);

                return ESUCC;
        } else {
                return EADDRINUSE;
        }
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param[in] UART              UART registers
 *
 * @return One of errno value.
 */
//==============================================================================
int _UART_LLD__turn_off(u8_t major)
{
        NVIC_DisableIRQ(UART[major].IRQn);
        SET_BIT(*UART[major].APBRSTR, UART[major].APBRSTR_UARTRST);
        CLEAR_BIT(*UART[major].APBRSTR, UART[major].APBRSTR_UARTRST);
        CLEAR_BIT(*UART[major].APBENR, UART[major].APBENR_UARTEN);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Function transmit currently setup buffer.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__transmit(u8_t major)
{
        sys_critical_section_begin();
        SET_BIT(UART[major].UART->CR1, USART_CR1_TCIE);
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function abort pending transmission.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__abort_trasmission(u8_t major)
{
        sys_critical_section_begin();
        CLEAR_BIT(UART[major].UART->CR1, USART_CR1_TCIE);
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function resume byte receiving.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__rx_resume(u8_t major)
{
        sys_critical_section_begin();
        SET_BIT(UART[major].UART->CR1, USART_CR1_RXNEIE);
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function hold byte receiving.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__rx_hold(u8_t major)
{
        sys_critical_section_begin();
        CLEAR_BIT(UART[major].UART->CR1, USART_CR1_RXNEIE);
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function configure selected UART.
 *
 * @param major         major device number
 * @param config        configuration structure
 */
//==============================================================================
void _UART_LLD__configure(u8_t major, const struct UART_config *config)
{
        const UART_regs_t *DEV = &UART[major];
        u32_t PCLK = 0;

        /* set baud */
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);

        switch (DEV->CLKSRC) {
        case USART_CLKSOURCE_PCLK1:
                PCLK = freq.PCLK1_Frequency;
                break;

